{
	"intents": [{
			"tag": "greeting",
			"patterns": ["Hi there", "How are you", "Is anyone there?", "Hey", "Hola", "Hello", "Good day"],
			"responses": ["Hello, How can i Help you?", "Hello, How can i Assist you?", "Hi there, how can I help?"]
		},
		{
			"tag": "goodbye",
			"patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time"],
			"responses": ["See you!", "Have a nice day", "Bye! Come back again soon."]
		},
		{
			"tag": "thanks",
			"patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
			"responses": ["Happy to help! May I assist you with anything else?", "Any time! May I assist you with anything else?", "My pleasure, May I assist you with anything else?"]
		},
		{
			"tag": "noanswer",
			"patterns": [],
			"responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand"]
		},
		{
			"tag": "location",
			"patterns": [
				"Where is University of Central Missouri?",
				"Where is UCM located?",
				"What is the location of University of Central Missouri?"
			],
			"responses": [
				"The University of Central Missouri is located in Warrensburg, Missouri, United States."
			]
		},
		{
			"tag": "main_campus",
			"patterns": [
				"Which is the main campus of the University of Central Missouri?",
				"What is the main campus of UCM?",
				"Where is the main campus of University of Central Missouri?"
			],
			"responses": [
				"The Warrensburg campus is the main campus of the University of Central Missouri."
			]
		},
		{
			"tag": "number_of_campuses",
			"patterns": [
				"How many campuses are there in University of Central Missouri?",
				"What is the number of campuses in UCM?",
				"Does UCM have multiple campuses?"
			],
			"responses": [
				"The University of Central Missouri has one main campus in Warrensburg and multiple satellite locations throughout Missouri."
			]
		},
		{
			"tag": "virtual_tour_link",
			"patterns": [
				"I need a link to visit the virtual tour of the campus.",
				"Can you provide me a link to the virtual tour of the University of Central Missouri?",
				"How can I access the virtual tour of UCM?"
			],
			"responses": [
				"You can visit the virtual tour of the University of Central Missouri at https://www.ucmo.edu/about/virtual-tour.html"
			]
		},
		{
			"tag": "warrensburg_campus_address",
			"patterns": [
				"What is the address of the University of Central Missouri Warrensburg campus?",
				"Where can I find the address of UCM Warrensburg campus?",
				"Can you tell me the address of University of Central Missouri main campus?"
			],
			"responses": [
				"The address of the University of Central Missouri Warrensburg campus is 108 W. South Street, Warrensburg, MO 64093."
			]
		},
		{
			"tag": "contact_number",
			"patterns": [
				"What is the University contact number?",
				"How can I contact the University of Central Missouri?",
				"Can you provide me with the contact number of UCM?"
			],
			"responses": [
				"You can contact the University of Central Missouri at +1 (660) 543-4111."
			]
		},
		{
			"tag": "reach_university",
			"patterns": [
				"How can I reach the University?",
				"What is the best way to reach University of Central Missouri?",
				"Can you guide me on how to reach UCM?"
			],
			"responses": [
				"The University of Central Missouri is located in Warrensburg, Missouri. You can reach the University by car, bus, or plane. The nearest airport is the Kansas City International Airport (MCI)."
			]
		},
		{
			"tag": "why_apply",
			"patterns": [
				"Why should I apply at UCM University?",
				"What are the benefits of studying at University of Central Missouri?",
				"Can you tell me the advantages of applying to UCM?"
			],
			"responses": [
				"The University of Central Missouri offers a diverse range of academic programs, exceptional faculty, state-of-the-art facilities, and a supportive learning environment that fosters growth and development. Our faculty members are committed to providing individualized attention and guidance to our students, helping them achieve their academic and personal goals. UCM also provides numerous opportunities for students to engage in research, internships, and community service, helping them gain valuable real-world experience that can enhance their career prospects. Additionally, UCM has a strong reputation for academic excellence, and our graduates are highly sought after by employers across a wide range of industries. Finally, UCM offers a welcoming and inclusive community, where students from diverse backgrounds can connect, collaborate, and learn from one another."
			]
		},
		{
			"tag": "fall_semester_start",
			"patterns": [
				"When will the fall semester start?",
				"What is the date for the commencement of fall semester?"
			],
			"responses": [
				"The fall semester at University of Central Missouri usually starts in late August. You can check the academic calendar on our website for specific dates and deadlines."
			]
		},
		{
			"tag": "CS_application_dates",
			"patterns": [
				"What are the dates to apply for CS ?",
				"When is the deadline to submit application for computer science program?",
				"Can you tell me the application timeline for computer science course?"
			],
			"responses": [
				"The application deadlines for the computer science program vary depending on whether you are applying for the undergraduate or graduate program. You can find the specific application dates on our website, or you can contact our admissions office for more information."
			]
		},
		{
			"tag": "summer_semester_start",
			"patterns": [
				"When will summer semester start?",
				"What is the date for the commencement of summer semester?"
			],
			"responses": [
				"The summer semester at University of Central Missouri usually starts in late May or early June. You can check the academic calendar on our website for specific dates and deadlines."
			]
		},
		{
			"tag": "spring_semester_start",
			"patterns": [
				"When will spring semester start?",
				"What is the date for the commencement of spring semester?"
			],
			"responses": [
				"The spring semester at University of Central Missouri usually starts in mid-January. You can check the academic calendar on our website for specific dates and deadlines."
			]
		},
		{
			"tag": "application_procedure",
			"patterns": [
				"What is the procedure of applying and from which website do we have to apply ?",
				"How can I apply to University of Central Missouri?",
				"What are the steps involved in applying to UCM?"
			],
			"responses": [
				"To apply to University of Central Missouri, you can visit our website and complete the online application form. The application process and requirements vary depending on whether you are applying for an undergraduate or graduate program. You can find detailed information about the application process on our website or you can contact our admissions office for assistance."
			]
		},
		{
			"tag": "CS_masters_cost",
			"patterns": [
				"How much does it cost to study the computer science masters program in University of Central Missouri?",
				"Can you tell me about the tuition fees for the computer science masters program at UCM?",
				"What is the cost of the computer science masters program at University of Central Missouri?"
			],
			"responses": [
				"The cost of tuition for the computer science masters program at University of Central Missouri varies depending on whether you are an in-state or out-of-state student. For in-state students, the tuition is approximately $8,458 per year, while out-of-state students pay approximately $15,088 per year. In addition to tuition, there may be additional fees for things like textbooks, housing, and other expenses. However, UCM offers a range of financial aid options, including scholarships, grants, and student loans, to help make higher education more accessible to all students."
			]
		},
		{
			"tag": "UCM_qualifications",
			"patterns": [
				"What are the qualifications required to apply for the University of Central Missouri?",
				"Can you tell me about the admission requirements for UCM?",
				"What do I need to get into University of Central Missouri?"
			],
			"responses": [
				"The admission requirements for the University of Central Missouri vary depending on the program you are applying for. Generally, undergraduate applicants are required to have a high school diploma or equivalent, and to have completed a minimum of 16 units of high school coursework. Graduate applicants are generally required to have a bachelor's degree from an accredited institution, and to meet minimum GPA and standardized test score requirements. Additionally, some programs may have specific requirements, such as a portfolio or work experience. Please check the UCM website or contact the admissions office for specific information about the requirements for the program you are interested in."
			]
		},
		{
			"tag": "UCM_IELTS_score",
			"patterns": [
				"What is the IELTS score required to apply for the University of Central Missouri?",
				"Can you tell me about the English language proficiency requirements for UCM?",
				"What is the minimum IELTS score required for admission to University of Central Missouri?"
			],
			"responses": [
				"The minimum IELTS score required for admission to the University of Central Missouri varies depending on the program you are applying for. Generally, undergraduate applicants are required to have a minimum score of 6.0 on the IELTS exam, while graduate applicants are required to have a minimum score of 6.5. However, some programs may have higher requirements, so please check the UCM website or contact the admissions office for specific information about the requirements for the program you are interested in."
			]
		},
		{
			"tag": "UCM_GRE_score",
			"patterns": [
				"What is the GRE score required to apply for the University of Central Missouri?",
				"Can you tell me about the standardized test score requirements for UCM?",
				"What is the minimum GRE score required for admission to University of Central Missouri?"
			],
			"responses": [
				"The minimum GRE score required for admission to the University of Central Missouri varies depending on the program you are applying for. Generally, graduate applicants are required to have a minimum combined score of 290 on the verbal and quantitative sections of the GRE, and a minimum score of 3.5 on the analytical writing section. However, some programs may have higher or lower requirements, so please check the UCM website or contact the admissions office for specific information about the requirements for the program you are interested in."
			]
		},
		{
			"tag": "UCM_scholarships",
			"patterns": [
				"Can you tell me about the scholarship opportunities from the University of Central Missouri?",
				"What kind of financial aid is available for students at UCM?",
				"Are there any scholarships or grants available for students at University"
			],
			"responses": [
				"Yes, the University of Central Missouri offers a range of scholarships and financial aid options for eligible students. These include academic scholarships, need-based scholarships, athletic scholarships, and work-study programs. You can find more information on our website or contact our Office of Student Financial Services for assistance.",
				"There are various scholarship and financial aid opportunities available for students at the University of Central Missouri. You can visit our website or contact our Office of Student Financial Services for more information on the different options and eligibility requirements."
			]
		},
		{
			"tag": "graduate_programs",
			"patterns": [
				"What are the graduate programs present in the University of Central Missouri?",
				"Can you provide information on the graduate programs offered by UCM?",
				"Which are the popular graduate programs at UCM?"
			],
			"responses": [
				"The University of Central Missouri offers a wide range of graduate programs in various fields, including business, education, engineering, mathematics, nursing, and psychology, among others. Some of the popular graduate programs at UCM are the MBA program, the Master's in Education program, and the Master's in Computer Science program. You can find more information on our website or contact the specific department for details on their graduate programs."
			]
		},
		{
			"tag": "undergrad_programs",
			"patterns": [
				"What are the undergraduate programs present in University of Central Missouri?",
				"Can you provide information on the undergraduate programs offered by UCM?",
				"Which are the popular undergraduate programs at UCM?"
			],
			"responses": [
				"The University of Central Missouri offers a wide range of undergraduate programs in various fields, including arts, business, education, engineering, health sciences, humanities, mathematics, science, and technology, among others. Some of the popular undergraduate programs at UCM are the Bachelor's in Business Administration program, the Bachelor's in Nursing program, and the Bachelor's in Psychology program. You can find more information on our website or contact the specific department for details on their undergraduate programs."
			]
		},
		{
			"tag": "engineering_test_info",
			"patterns": [
				"I need information on the pattern of UCM Engineering entry test?",
				"What is the format of the UCM Engineering entrance test?",
				"Can you tell me about the UCM Engineering admission test?"
			],
			"responses": [
				"The UCM Engineering entrance test consists of multiple-choice questions covering various topics, such as mathematics, physics, and chemistry. The test is designed to assess the applicant's knowledge and skills in these areas. You can find more information on our website or contact the UCM School of Engineering for details on the test format and preparation materials."
			]
		},
		{
			"tag": "engineering_test_negative_marking",
			"patterns": [
				"What is the information regarding negative marking in the UCM Engineering entrance test?",
				"Is there any negative marking in the UCM Engineering admission test?",
				"Do I lose marks for incorrect answers in the UCM Engineering entrance exam?"
			],
			"responses": [
				"No, there is no negative marking in the UCM Engineering entrance test. So, it is advised to attempt all the questions to maximize your score."
			]
		},
		{
			"tag": "sports_admission_procedure",
			"patterns": [
				"What is the procedure for taking admission in UCM University on the basis of sports?",
				"Can I get admission in University of Central Missouri through sports quota?",
				"How can I apply for UCM University on the basis of my sports achievements?"
			],
			"responses": [
				"Yes, UCM University provides admission to students based on their sports achievements. To apply through sports quota, you need to contact the Athletics Department of the University and provide them with your sports credentials. You will also need to fulfill the academic requirements set by the University."
			]
		},
		{
			"tag": "entry_test_clearing_percentage",
			"patterns": [
				"What is the percentage required for clearing the entry test at UCM University?",
				"Is there a minimum percentage required to pass the UCM University entry test?",
				"How much should I score in the UCM University entrance exam to qualify?"
			],
			"responses": [
				"The minimum percentage required to pass the UCM University entry test varies for each program. You can contact the Admissions Office of the University to get more information about the passing percentage of your desired program."
			]
		},
		{
			"tag": "civil_eng_score_requirement",
			"patterns": [
				"What is the required score to get an admission in Civil Engineering program at UCM University?",
				"Can you tell me about the minimum score requirement for Civil Engineering program at UCM University?",
				"How much should I score in my entrance exam to get admission in UCM University's Civil Engineering program?"
			],
			"responses": [
				"The required score to get admission in UCM University's Civil Engineering program may vary from year to year depending on various factors such as the number of applicants and the level of difficulty of the entrance exam. You can contact the Admissions Office of the University to get more information about the minimum score requirement for the current academic year."
			]
		},
		{
			"tag": "academic_year",
			"patterns": [
				"When does the academic year of UCM University begin and end?",
				"Can you tell me the start and end dates of UCM University's academic year?",
				"What are the dates of the academic year of UCM University?"
			],
			"responses": [
				"The academic year of UCM University begins in the fall semester and ends in the summer semester. The start and end dates may vary for each semester and program. You can check the University's academic calendar on its official website to get more information about the exact dates."
			]
		},
		{
			"tag": "departments",
			"patterns": [
				"What are the various departments present on UCM University campus?",
				"Can you tell me about the different academic departments at UCM University?",
				"What are the subjects offered by UCM University?"
			],
			"responses": [
				"UCM University offers a wide range of academic departments and programs including Business, Education, Engineering Technology, Health and Human Performance, Humanities, Social Sciences, and Natural Sciences. You can visit the University's official website to get more information about the specific departments and their offerings."
			]
		},
		{
			"tag": "cs_course_subjects",
			"patterns": [
				"What are the subjects present in the Computer Science course at UCM University?",
				"Can you tell me about the syllabus of the Computer Science course at UCM University?",
				"What are the topics covered in the Computer Science course at UCM?"
			],
			"responses": [
				"The Computer Science course at University of Central Missouri covers a range of topics such as programming languages, algorithms, data structures, computer organization, software engineering, databases, computer networks, artificial intelligence, and computer graphics. The course is designed to equip students with the skills and knowledge needed to succeed in the field of computer science."
			]
		},
		{
			"tag": "faculty_info",
			"patterns": [
				"Can you provide information about the faculty at UCM University?",
				"What are the qualifications of the faculty at University of Central Missouri?"
			],
			"responses": [
				"The faculty at University of Central Missouri consists of experienced and knowledgeable professors who are experts in their respective fields. The faculty members hold advanced degrees and have significant industry experience. They are committed to providing students with a challenging and rewarding academic experience and preparing them for successful careers."
			]
		},
		{
			"tag": "financial_aid",
			"patterns": [
				"Is financial aid available at UCM University?",
				"What are the options for financial aid at University of Central Missouri?",
				"How can I apply for financial aid at UCM University?"
			],
			"responses": [
				"Financial aid is available at University of Central Missouri in the form of scholarships, grants, loans, and work-study programs. To apply for financial aid, students must complete the Free Application for Federal Student Aid (FAFSA) form. The university also offers a variety of scholarships and grants based on academic merit, financial need, and other criteria."
			]
		},
		{
			"tag": "research_facility",
			"patterns": [
				"Does UCM University have research facilities?",
				"What are the research opportunities available at University of Central Missouri?",
				"How can I get involved in research at UCM University?"
			],
			"responses": [
				"Yes, University of Central Missouri has research facilities that provide students with opportunities to engage in research projects in various fields. The university has research centers and institutes that focus on areas such as aviation, mathematics education, entrepreneurship, and environmental studies. Students can work with faculty members on research projects, and there are also opportunities for students to present their research findings at conferences and publish their work in academic journals."
			]
		},
		{
			"tag": "hostel_facility",
			"patterns": [
				"Is there any hostel facility on campus?",
				"Does UCM University provide housing for students?",
				"What are the options for student housing at University of Central Missouri?"
			],
			"responses": [
				"Yes, University of Central Missouri provides housing options for students. The university has several residence halls and apartment-style complexes that offer a variety of living arrangements to meet the needs of different students. Students can choose from single, double, or triple occupancy rooms and can opt for meal plans as well. The university also offers off-campus housing options for students who prefer to live off-campus."
			]
		},
		{
			"tag": "entrance_test",
			"patterns": [
				"Do we require any entrance test for the University to get in?",
				"What are the entrance exams required for admission to University of Central Missouri?",
				"Is there an entrance test for UCM?",
				"Which entrance exams are required for admission to UCM?"
			],
			"responses": [
				"Admission requirements vary depending on the program and level of study. Some programs require standardized test scores, while others do not. We recommend checking the specific admission requirements for the program you are interested in on the university's website. If you have any further questions, you can contact the admissions office for more information."
			]
		},
		{
			"tag": "GPA_calculation",
			"patterns": [
				"How is GPA calculated?",
				"Can you explain the GPA calculation method at UCM?"
			],
			"responses": [
				"GPA is calculated by assigning a point value to each grade earned in a course and averaging those values. At the University of Central Missouri, the standard grade point scale is as follows: A = 4.0, B = 3.0, C = 2.0, D = 1.0, F = 0.0. To calculate your GPA, add up the grade point values for all your courses and divide by the total number of credit hours attempted. If you have any questions about your GPA or how it is calculated, you can contact your academic advisor."
			]
		},
		{
			"tag": "course_withdrawal",
			"patterns": [
				"When can a student withdraw a course?",
				"Is it possible to drop a course after the semester has started?",
				"What is the process for withdrawing from a course at UCM?"
			],
			"responses": [
				"Students can withdraw from a course during the first 60% of the semester without receiving a failing grade. The deadline to withdraw from a course is typically listed on the academic calendar. If you decide to withdraw from a course, you should contact your academic advisor to discuss the process and any potential consequences, such as financial aid or academic progress."
			]
		},
		{
			"tag": "course_ranking",
			"patterns": [
				"What is the ranking of the University of Central Missouri's computer science program?",
				"How does UCM's computer science program compare to other universities?",
				"Where does UCM's computer science program rank nationally?"
			],
			"responses": [
				"The University of Central Missouri's computer science program has consistently been ranked as one of the best in the region. According to U.S. News & World Report's 2022 rankings, UCM's computer science program is ranked #82 in the nation among public universities. Additionally, the program is accredited by the Computing Accreditation Commission of ABET, which is the recognized accreditor for college and university programs in applied science, computing, engineering, and technology."
			]
		},
		{
			"tag": "course_completion",
			"patterns": [
				"What is the time period to complete the computer science course at UCM?",
				"How long does it take to complete the computer science program at UCM?",
				"What is the minimum and maximum duration to complete the computer science program at UCM?"
			],
			"responses": [
				"The time it takes to complete the computer science program at UCM depends on a variety of factors, including the number of credit hours you take per semester and any transfer credits you may have. Generally, students can complete the program in two to three years if they attend full-time. However, part-time options are also available for students who need more flexibility. You should work with your academic advisor to develop a plan that works best for you."
			]
		},
		{
			"tag": "CS_start_date",
			"patterns": [
				"When will the computer science program begin?",
				"When does the fall semester start for computer science program at UCM?",
				"What are the start dates for computer science program at UCM?"
			],
			"responses": [
				"The start date for the computer science program at UCM varies depending on the semester. The fall semester typically begins in late August, while the spring semester typically begins in January. For specific dates, please check the UCM academic calendar on the university's website."
			]
		},
		{
			"tag": "working_hours",
			"patterns": [
				"What are the working hours of the University of Central Missouri?",
				"When is the University of Central Missouri open?",
				"What are the office hours for UCM?"
			],
			"responses": [
				"The working hours for the University of Central Missouri varies depending on the day and department. Generally, the university is open from Monday to Friday, from 8:00 AM to 5:00 PM. However, some departments may have different working hours. You can check the specific department's website for their office hours."
			]
		},
		{
			"tag": "ucm_rank",
			"patterns": [
				"What is the rank of the University of Central Missouri in the US?",
				"How does UCM rank among other universities in the US?",
				"Can you tell me about UCM's ranking?"
			],
			"responses": [
				"The University of Central Missouri is consistently ranked among the top universities in the Midwest by various ranking agencies. According to U.S. News & World Report's 2022 Best Colleges rankings, UCM is ranked #102 in the Regional Universities Midwest category. Additionally, UCM is ranked #40 in Top Public Schools and #49 in Best Undergraduate Engineering Programs among schools whose highest degree is a Bachelor's or Master's degree. However, it is important to note that rankings are just one factor to consider when choosing a university, and students should also consider other factors such as the academic programs, faculty, facilities, and campus environment."
			]
		},
		{
			"tag": "cs_course_website",
			"patterns": [
				"Where can I apply for the computer science course on the university website?",
				"Can you give me the link to apply for the computer science course at UCM?",
				"How do I apply for the computer science program at UCM?"
			],
			"responses": [
				"You can apply for the computer science program at the University of Central Missouri through the university's website. Here is the link to the application page: https://www.ucmo.edu/admissions/apply/. From there, you can select the computer science program and follow the instructions to complete your application."
			]
		},
		{
			"tag": "ongoing_events",
			"patterns": [
				"What are the ongoing events currently on the UCM campus?",
				"Are there any events happening on the UCM campus right now?",
				"Can you tell me about the current events at UCM?"
			],
			"responses": [
				"There are always events happening on the University of Central Missouri campus. From academic conferences and workshops to cultural and entertainment events, there is something for everyone. You can check the university's event calendar on their website to see what events are currently happening or upcoming."
			]
		},
		{
			"tag": "graduation_rate",
			"patterns": [
				"What is the graduation rate of the University of Central Missouri?",
				"How many students graduate from UCM each year?",
				"Can you tell me about UCM's graduation rate?"
			],
			"responses": [
				"The graduation rate of the University of Central Missouri varies depending on the program and student demographics. According to the UCM 2021 Factbook, the overall graduation rate for first-time, full-time, degree-seeking undergraduate students who started in Fall 2015 and graduated within six years is 49.6%. However, it is important to note that graduation rates can vary based on individual circumstances, and the university provides various resources and support services to help students succeed academically and graduate on time."
			]
		},
		{
			"tag": "placement_rate",
			"patterns": [
				"What is the placement rate for UCM graduates?",
				"How successful are UCM graduates in finding jobs after graduation?",
				"Can you tell me about UCM's job placement rate?"
			],
			"responses": [
				"UCM has a strong record of placing its graduates in employment positions. According to the latest data, the overall placement rate for UCM graduates is around 95%. The university has a dedicated Career Services center that helps students and alumni with job search strategies, interview preparation, resume building, and more. Additionally, UCM has strong partnerships with local and national employers, which provide students with valuable networking opportunities and potential job openings."
			]
		},
		{
			"tag": "current_employment",
			"patterns": [
				"How many people are currently employed in a particular course at UCM?",
				"What are the job prospects for a specific program at UCM?",
				"Can you tell me about the current employment opportunities in a particular department at UCM?"
			],
			"responses": [
				"The number of people currently employed in a specific program at UCM can vary depending on the department and the job market demand. However, UCM has a strong record of placing its graduates in employment positions, with a placement rate of around 95%. The Career Services center at UCM can provide students and alumni with more specific information about current employment opportunities and job prospects in their desired fields."
			]
		}
	]
}